---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.Insert(Autodesk.Revit.UI.IExternalApplication,System.Int32)
source: html/84f74cd7-56ee-b3e7-2bd7-cfe3afbf9904.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.Insert Method

Insert the specified item into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	IExternalApplication item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.UI.IExternalApplication`) - The item to be inserted into the array.
- **index** (`System.Int32`) - The item will be inserted before this index.

## Returns
Returns whether the item was inserted into the array.